Dynamo.Logging.IAnalyticsClient.ReportingUsage
Checks if detailed usage reporting is ON.

Dynamo.Logging.IAnalyticsClient.LogPiiInfo(System.String,System.String)
Logs usage data
tag: Usage tag
data: Usage data