Dynamo.Logging.Analytics.ReportingAnalytics
Returns if any analytics reporting is ON (Google, ADP etc.)

Dynamo.Logging.Analytics.TrackCommandEvent(System.String,System.String,System.Nullable{System.Int32})
Creates a new command event of the given name. Start of the
command is tracked. When the event is disposed, it's completion is tracked.
name: Command name
description: Event description
value: A metric value associated with the event
Returns: Event as IDisposable

Dynamo.Logging.Analytics.LogPiiInfo(System.String,System.String)
Logs usage data
tag: Usage tag
data: Usage data