Dynamo.Configuration.DebugModes.DebugMode
Represents an instance of a debug mode

Dynamo.Configuration.DebugModes.DebugMode.Name
Name of the debug mode

Dynamo.Configuration.DebugModes.DebugMode.Description
Description of the debug mode

Dynamo.Configuration.DebugModes.DebugMode.IsEnabled
Whether debug mode is enabled or not