Dynamo.Graph.Workspaces.LayoutExtensions.DoGraphAutoLayout(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean)
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.
workspace: Workspace on which graph layout will be performed.
reuseUndoRedoGroup: If true, skip initializing new undo action group.