Dynamo.Models.DynamoModel.CreateAnnotationCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.Double,System.Double,System.Boolean)
annotationId:
annotationText:
x:
y:
defaultPosition: