Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(System.String,System.Guid,System.Double,System.Double,Dynamo.Engine.LibraryServices,ProtoCore.Namespace.ElementResolver)
Initializes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class
userCode: Code block content
guid: Identifier of the code block
xPos: X coordinate of the code block
yPos: Y coordinate of the code block
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries
resolver: Responsible for resolving
a partial class name to its fully resolved name

Dynamo.Graph.Nodes.CodeBlockNodeModel.LoadAndCreateConnectors(System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,Dynamo.Graph.SaveContext)
Now that the portData has been set for the new ports, we recreate the connections we
so mercilessly destroyed, restoring peace and balance to the world once again.
inportConnections:
outportConnections:  List of the connections that were killed
context: context this operation is being performed in