Dynamo.Logging.AnalyticsService.Start(Dynamo.Models.DynamoModel)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: DynamoModel

Dynamo.Logging.AnalyticsService.IsADPOptedIn
Indicates whether the user has opted-in to ADP analytics.