Dynamo.Engine.CompilationServices.PreCompileCodeBlock(ProtoCore.Utils.ParseParam@)
Pre-compiles Design script code in code block node.
parseParams: Container for compilation related parameters
Returns: true if code compilation succeeds, false otherwise