Dynamo.Configuration.DebugModes
Provide functionality around debug modes. Similar to feature flags.

Dynamo.Configuration.DebugModes.#cctor
Static constructor

Dynamo.Configuration.DebugModes.SetDebugModeEnabled(System.String,System.Boolean)
Enables/Disables a debug mode
name: Name of the debug mode
enabled: Enable/Disable debug mode

Dynamo.Configuration.DebugModes.GetDebugModes
Returns a dictionary of all the debug modes

Dynamo.Configuration.DebugModes.GetDebugMode(System.String)
Retrieves a debug mode
name: Name of the debug mode

Dynamo.Configuration.DebugModes.IsEnabled(System.String)
Retrieves the state of a debug mode (enabled/disabled)
name: Name of the debug mode