Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetFunctionSignatures(System.String,System.String,System.String,ProtoCore.Namespace.ElementResolver)
Returns the list of function signatures of all overloads of a given method
code:  code being typed in code block
functionName:  given method name for which signature is queried
functionPrefix:  class name in case of constructor or static method, OR
declared instance variable on which method is invoked
resolver:
Returns:  list of method overload signatures