Dynamo.Core.CustomNodeManager.AddUninitializedCustomNodesInPath(System.String,System.Boolean,Dynamo.Graph.Workspaces.PackageInfo)
Scans the given path for custom node files, retaining their information in the manager for later
potential initialization. Should be used when packages load or reload customNodes.
path: Path on disk to scan for custom nodes.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
PackageInfo:
Info about the package that requested this customNode to be loaded or to which the customNode belongs.
Is PackageMember property will be true if this property is not null.
Returns: