Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Create a Cuboid centered at WCS origin, with width, length, and height.
width:
length:
height:
Returns:
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Create a Cuboid centered at input Point, with specified width, length,  and height.
origin:
width:
length:
height:
Returns:
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Create a Cuboid centered and oriented to input CoordinateSystem, with  specified width, length, and height.
cs:
width:
length:
height:
Returns:
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an Cuboid spanning from low Point to high Point.
lowPoint:
highPoint:
Returns:
box,cube,byminmax,by corners,by points,cubes