Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Create an Ellipse centered at input Point, aligned with WCS XY Plane, with specified X and Y axis radii.
origin:
xAxisRadius:
yAxisRadius:
Returns:
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create an Ellipse centered at input Point, with two specified axes.  Axes should be be at 90 degrees to each other.
origin:
xAxisRadius:
yAxisRadius:
Returns:
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Create an Ellipse centered and aligned with input CoordinateSystem,  with a x_radius radius in the CS X direction, and y_radius radius in the  CS Y direction.
origin:
xAxisRadius:
yAxisRadius:
Returns:
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Create an Ellipse centered and aligned with input Plane, with a x_radius  radius in the Plane X axis direction, and y_radius radius in the  Plane Y axis direction.
plane:
xAxisRadius:
yAxisRadius:
Returns:
ellipse,aligned ellipse,ellipsebylengths