Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Plane centered at root Point, with input normal Vector.
origin: Plane's root point
normal: Plane's normal
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create an "oriented" T-Spline Plane, positioned at Point origin with Vector normal, but with a specific X-axis orientation.
This has no impact to splitting, intersect, project, etc. operations, it only specifies the orientation of the input CoordinateSystem.
origin: Plane's root point
normal: Plane's normal
xAxis: Plane's x-axis
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a Plane by origin and X, Y axis.
The Z axis is the cross product of the two Vectors.
origin: Plane's root point
xAxis: Plane's x-axis
yAxis: Plane's y-axis
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Fit a T-Spline Plane to the input Points; basically a 3D scatterplot fit.
points: A set of points to fit to plane
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,fit,bestfit,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create the T-Spline Plane containing the input Line and external Point. Point cannot lie on the Line or anywhere on the axis of the Line.
line: Line to build a plane
point: Point to build a plane
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Plane containing the three input Points. The Points cannot lie on a straight line
p1: First point to build a plane
p2: Second point to build a plane
p3: Third point to build a plane
minCorner: 2D point of minimum corner in plane's coordinates
maxCorner: 2D point of maximum corner in plane's coordinates
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Construct a T-Spline Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
cs: Cylinder's center and base will be fit at X-Y plane of this coordinate system
radius: Radius of a cylinder
height: Height of a cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with given base radius at start Point,
extending to an apex at end Point.
startPoint: Start point of a cone
endPoint: End point of a cone
radius: Radius of a cone's base
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending in the direction of CoordinateSystem's Z-axis,
with a  circular base in the CoordinateSystem XY Plane.
cs: Cone's center and base will be fit at X-Y plane of this coordinate system
height: Height of a cone
radius: Radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending in the direction of CoordinateSystem Z-axis,
with its circular base in the CoordinateSystem XY Plane.
cs: Cone's center and base will be fit at X-Y plane of this coordinate system
height: Height of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered and oriented to input CoordinateSystem, with  specified width, length, and height.
cs: Box's X-Y plane will be aligned with correspondi X
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with center at CoordinateSystem origin  and given radius
cs: Local coordinate system
radius: Quadball radius
spans: Spans number in two dimensions of quadball's sides
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with given center and radius, aligned with  default World XY plane
center: Quadball center point
radius: Quadball radius
spans: Spans number in two dimensions of quadball's sides
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Construct a T-Spline by extruding a curve along the given vector.
curve: Profile curve
direction: Extrude vector
frontDistance: Extrude distance by vector direction
backDistance: Extrude distance againts vector direction
frontSpans: Spans number by vector direction. No extrusion by vector direction will be performed if 0 is passed
backSpans: Spans number againts vector direction. No extrusion against vector direction will be performed if 0 is passed
profileSpans: Spans number in profile direction. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution along profile direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Make a piped surface out of a network of curves or lines.
A smooth joint is created at each curve intersection.
Some parameters take single value or list - one value per curve.
curves: A list of curves to create pipes from
defaultRadius: Default radius for created pipes
snappingTolerance: The tolerance used to detect curve intersections
segmentsCount: Numbers of segments for each curve. The size of the list can be the curve count or 1 for replication or 0 for automatic determination.
autoHandleStart: If true, the parameters of the handle at the start of each curve are automatically generated, and the custom parameters of rotationsAtStart, radiiAtStart, and positionsAtStart are ignored.
autoHandleEnd: If true, the parameters of the handle at the end of each curve are automatically generated, and the custom parameters of rotationsAtEnd, radiiAtEnd, and positionsAtEnd are ignored.
startRotations: Custom rotation angle in degrees for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRotations: Custom rotation angle in degrees for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startRadii: Custom radius for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRadii: Custom radius for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startPositions: Custom position of each pipe handle at the start of each curve in percentage between 0 and 1 along the curve's arc-length. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
endPositions: Custom position of each pipe handle at the end of each curve in percentage between 0 and 1 along the curve's arc-length. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combine given T-Spline Surfaces into single one.
Surface can be not connected to each other.
If at least one surface is in box mode - output surface will be in box mode as well.
tSplineSurfaces: T-Spline Surfaces to combine
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convert TSpline surface to Solid or Surface depending on shape
matchTopology: Determines should resulted body has the same topology as TSpline has
Returns: Topology entity (Solid or Surface)
tspline,brep,solid,surface