Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a BSplineCurve by using explicit control points. NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems for extrusion, sweep, and other operations. They should be avoided. Use  a PolyCurve instead.  NOTE 2: If the curve is periodic (closed), then the first and last points MUST be the same.
points:
Returns:
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Create a BSplineCurve by using explicit control points. NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems for extrusion, sweep, and other operations. They should be avoided. Use  a PolyCurve instead.  NOTE 2: If the curve is periodic (closed), then the first and last points MUST be the same.
points:
degree:
Returns:
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Create a BSplineCurve by using explicit control points. NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems for extrusion, sweep, and other operations. They should be avoided. Use  a PolyCurve instead.  NOTE 2: If the curve is periodic (closed), then the first and last points MUST be the same.
points:
degree:
closeCurve:
Returns:
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a BSplineCurve by interpolating between points.
points:
Returns:
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Create a BSplineCurve by interpolating between points. NOTE 2: If the curve is periodic (closed), then the first and last points MUST be the same.
points:
closeCurve:
Returns:
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Create a BSplineCurve by interpolating between points with specified degree.
points:
degree:
Returns:
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns a BSplineCurve through the points, with tangent directions.
points:
startTangent:
endTangent:
Returns:
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.IsPeriodic
Whether the NurbsCurve is periodic or not
isclosed

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
The knots of the Curve.  These, along with the Degree, define the domain of the Curve where a particular control vertex acts.
Returns:

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
The weights of the control vertices of the curve.  These define the magnitude of influence of the control vertices.
Returns:
ptweight