Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Creates a straight Line between two input Points.
startPoint:
endPoint:
Returns:
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Creates a Line best approximating a scatter plot of Points.
bestFitPoints:
Returns:
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Create a Line tangent to the input Curve, positioned at the parameter Point of the input Curve.
curve:
parameter:
Returns:
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Create a straight Line starting at start Point, extending in Vector direction by specified length.
startPoint:
direction:
length:
Returns:
linebyvector,lines