Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Create a Plane centered at root Point, with input normal Vector.
origin:
normal:
Returns:
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create an "oriented" Plane, positioned at Point origin with Vector  normal, but with a specific X axis orientation. This has no impact to splitting, intersect, project, etc oporations, it only specifies the orientation of the input CoordinateSystem.
origin:
normal:
xAxis:
Returns:

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
The X and Y axis lie in the plane. The Z axis is the cross product of the two Vectors.
origin:
xAxis:
yAxis:
Returns:

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Fits a Plane to the input Points; basically a 3D scatterplot fit.
points:
Returns:
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Create the Plane containing the input Line and external Point. Point cannot lie on the Line or in the Line axis.
line:
point:
Returns:
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Creates a plane in the world XY
Returns:

Autodesk.DesignScript.Geometry.Plane.XZ
Creates a plane in the world XZ plane
Returns:

Autodesk.DesignScript.Geometry.Plane.YZ
Creates a plane in the world YZ
Returns: