Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Create an axis-aligned BoundingBox around input Geometries.
geom:
Returns:
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Get the intersection of two BoundingBoxes
other:
Returns:

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determine whether two BoundingBoxes intersect
other:
Returns:
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Determine if the BoundingBox is empty
Returns:

Autodesk.DesignScript.Geometry.BoundingBox.Contains(Autodesk.DesignScript.Geometry.Point)
Determine if a point is inside of the BoundingBox
point:  The test point
Returns:  True if the point is inside, otherwise False
point inside,testpoint

Autodesk.DesignScript.Geometry.BoundingBox.ToCuboid
Get the BoundingBox as a Solid Cuboid
Returns:  A Cuboid representation of the BoundingBox
converttosolid,bb2cube,bb2cub,bounding tosolid,cubes
0.5,0.4,0.3,0.5,0.3

Autodesk.DesignScript.Geometry.BoundingBox.ToPolySurface
Get the BoundingBox as a collection of Surfaces
Returns:  A PolySurface representation of the BoundingBox
converttosurfaces,convert2surfaces,bbtosrfs,bbtosrfs,bounding to surfaces,bound to poly,convert2poly