Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Returns a Vector containing the X, Y, and Z scale factors
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate the object in the direction and magnitude of input Vector.
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Translates any CoordinateSystem type by the given distance in the given
direction.
direction: Displacement direction.
distance: Displacement distance along given direction.
Returns: Transformed CoordinateSystem.
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates an object around the origin and normal of the given Plane by a specified
degree
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale uniformly around a given point, using
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in one dimension by base and 2 pick points.  The scaling axis is defined by the line between base and pick0.
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in two dimension by base and 2 pick points  The two pick points are projected onto the base plane in order to determine the 2d scale factors
resize,size,from,to,scale2d,2d