Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Create a Solid by lofting between input cross sections closed PolyCurves.
This operation is optimized for sections composed of line segments exclusively,
with vertices following the same order.
The check and repair option guarantees the validity of the produced solid
when enabled, while disabling it should increase performance.
crossSections:
checkAndRepair:
Returns:
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Create a Solid of revolution, sweeping the profile Curve around the axis Ray formed by the origin and the axis Vector, from the start angle in degrees to the sweep angle in degrees.
profile:
axisOrigin:
axisDirection:
startAngle:
sweepAngle:
Returns:
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects the input Geometry onto this Solid, in the direction of the input Vector
geometryToProject:
projectDirection:
Returns:
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Separates a Solid into individual Solids if it comprises more than one
disjoint lump. Returns the same Solid if it is a single contiguous lump.
Returns: separate disjoint solids
///
split, disjoint