Autodesk.DesignScript.Geometry.Arc.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an arc by providing three sequential points along its circumference.
firstPoint:  First point along the curve
secondPoint:  Second point along the curve
thirdPoint:  Third point along the curve
Returns:  An Arc
arc,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointRadiusAngle(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,Autodesk.DesignScript.Geometry.Vector)
Create an arc by providing it's center point, radius, angle sweep, and normal vector
center:  The center of the arc
radius:  Radius of the arc
startAngle:  Start angle in degrees
endAngle:  End angle in degrees
normal:  A vector defining the normal of the arc
Returns:  An Arc
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointStartPointSweepAngle(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Create an arc by providing it's center point, start point, sweep point, and normal
centerPoint:  The center of the arc
startPoint:  The start point on the arc
sweepAngle:  The angle to sweep out
normal:  The normal to the arc
Returns:  An Arc
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an arc by providing it's center point, start point, and end point
centerPoint:  The center of the arc
startPoint:  The start point on the arc
endPoint:  The end point of the arc
Returns:  An Arc
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByFillet(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Double)
Create an arc by filleting two curves with given radius
curve1:  First curve
curve2:  Second curve
radius:  The radius of the fillet arc
Returns:  An Arc
arc,fillet,round,smooth,arcs

Autodesk.DesignScript.Geometry.Arc.ByFilletTangentToCurve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create an arc by filleting two curves tangent to given curve at internal point
curve1:  First curve
curveTangentTo:  curve to which the fillet arc is tangent at internal point
curve2:  Second curve
Returns:  An Arc
arc,fillet,round,smooth

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create an arc that best approximates a collection of points
points:  Points to fit
Returns:
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Create an Arc from start Point to end Point with start tangent to Vector
startPoint:
endPoint:
startTangent:
Returns:
arc,tangent,arcs

Autodesk.DesignScript.Geometry.Arc.Radius
The radius of the arc
arc,arcs

Autodesk.DesignScript.Geometry.Arc.StartAngle
The start angle in degrees
arc,arcs

Autodesk.DesignScript.Geometry.Arc.SweepAngle
The total sweep angle in degrees
arc,arcs