Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Creates a Circle with input center Point and radius in the world XY plane, with world Z as normal.
centerPoint:
radius:
Returns:
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Creates a Circle with specified center Point, radius, and normal direction.
centerPoint:
radius:
normal:
Returns:
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Create a Circle centered at the input Plane origin (root), lying in  the input Plane, with given radius.
plane:
radius:
Returns:
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a Circle passing through three input Points.
p1:
p2:
p3:
Returns:
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Best fit Circle through Points
points:  Points to fit
Returns:
circle,approximate