Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Make PolyCurve by joining curves. Flips curve as needed for connectivity. Choose a preferred join tolerance between 1e-6 and 1e-3 units.
curves:  Curves to join into polycurve
joinTolerance:  Tolerance to determine size of gap allowed between curves to be joined
Returns:
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Make PolyCurve by connecting points. Set the 'connectLastToFirst' input to true to close the PolyCurve.
points:  Points to make polycurve
connectLastToFirst:  make  close or open polycurve
Returns:
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.ByThickeningCurveNormal(Autodesk.DesignScript.Geometry.Curve,System.Double,Autodesk.DesignScript.Geometry.Vector)
Make PolyCurve by thickening a curve along a plane specified by the input normal.
curve:  the curve to thicken
thickness:  the thickness
normal:  the normal perpendicular to the thickening direction. If the normal is not supplied (is null), the curve normal is used by default.
Returns:  resulting polycurve
offset,thicken

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Returns curve of the polycurve by index
index:  Length to locate point
endOrStart:  counting from end or start of the polycurve
Returns:
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Extends polycurve by tangent arc
length:  Length of extension arc
radius:  Radius of arc
endOrStart:  extending end or start of the polycurve
Returns:

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Offset polycurve in its plane.
signedDistance:  Signed offset
extendCircular:  If true, corners will be made circular
Returns:

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Fillet polycurve in its plane.
radius:  Radius of fillet
rightSide:  If right side which to fillet
Returns:
round,smooth,radius