Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Union a collection of surfaces into one surface. This method might return a polySurface if the resulting union is non-manifold or multi-faced.
surfaces:  A collection of surfaces.
Returns:
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Create a Surface by lofting between input cross section Curves.
crossSections:
Returns:
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Loft a Surface through the cross sections with a specified guide curves (aka a rails). Guide curves must intersect all of the cross section  curves.
crossSections:
guideCurves:
Returns:
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create a Surface by sweeping a cross section Curve along a path.
profile:
path:
Returns:
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a Polygon Surface connecting input Points in a closed Polygon and patching it.
points:
Returns:
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep the cross section curve along a path guided by a two rails
path:  The input path to sweep along.
guideRail:  A rail to guide the orientation of the sweep.
profile:  The profile curve to sweep along the path.
Returns:
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Create a Surface by sweeping the profile Curve around the axis ray formed  by origin Point in the direction of the axis Vector, starting at start_angle in degrees, sweeping sweep_angle in degrees.
profile:
axisOrigin:
axisDirection:
startAngle:
sweepAngle:
Returns:
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Create a Surface by filling in the interior of a closed boundary defined by input Curves.
closedCurve:
Returns:
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Perimeter
Returns the sum of all edges of the Surface.
circumference

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
The boolean difference of this Surface and the union of input Surfaces. This method might return a polySurface if the resulting boolean is non-manifold or multi-faced.
others:
Returns:
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Trim the surface with a collection of one or more loops within the input surface.
One of the loops needs to be the boundary loop of the input surface.
In addition, one or more inner loops need to be added for holes.
loops:
Returns:
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Return the surface normal at the input Point on the Surface.
point:
Returns:
perpendicular

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Gets a Nurbs representation of the Surface within a specified tolerance. This method may approximate Surface in certain circumstances.
tolerance:
Returns:
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Thicken Surface into a Solid, extruding in the direction of Surface  normals on both sides of the Surface.
thickness:
Returns:
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Thicken Surface into a Solid, extruding in the direction of Surface  normals. If both_sides parameter is true, surface is thickened  on both sides.
thickness:
both_sides:
Returns:
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Offset Surface in direction of Surface normal by specified distance.
distance:
Returns:

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
The returned coordination system use xAxis, yAxis and zAxis to represent the uDir, vDir and normal. The length of xAxis, yAxis represents the curvatures.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Return a CoordinateSystem aligned with principal curvature directions.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Return the U tangent Vector at specified U and V parameters.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Return the V tangent Vector at specified U and V parameters.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Return the normal Vector at specified U and V parameters.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Return the derivatives at input U and V coordinates.
u:
v:
Returns:
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Returns principal direction vectors at U and V parameters.
u:
v:
Returns:

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Returns a new Surface with the Normal flipped. Leaves this surface unchanged.
Returns:

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects the input Geometry onto this Surface in the input Vector direction
geometryToProject:
projectionDirection:
Returns:
projecttosurface,projectonto