Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Create a mesh from a collection of Points and a collection of IndexGroups referencing the Point collection
vertexPositions:
indices:
Returns:
mesh,meshes