Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforms geometry by the given CoordinateSystem's transform

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
Imports a JSON string and returns an array of imported geometries
solidDefJson: Json string containg solid def formated geometry
Returns: List of converted geometries

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializes a list of specified geometry into Standard ACIS Binary(SAB) format and returns serialized binary stream data
geometry:
Returns: