Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
number of surfaces of Polysurface
Returns:

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
number of edges of Polysurface
Returns:

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
number of vertices of Polysurface
Returns: