Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Create a curve by line of surface in uv space
baseSurface:  Surface to use
startParams:  Starting uv at which curve will start
endParams:  Ending uv at which curve will end
Returns:
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Create a curve that blends between two curves
curve1:  First curve to blend
curve2:  Second curve to blend
endOrStart1:  flag to indicate which end of curve1 to blend
endOrStart2:  flag to indicate which end of curve1 to blend
isG2Continuous:  flag to indicate if resultant curve is of G1 continuity or G2 continuity
Returns:
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Create a curve by isoline of surface
baseSurface:  Base surface
direction:  if 0 isoline is along u direction, if 1 along v direction
parameter:  fixed for the curve value of other surface parameter
Returns:
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Length
The total arc length of the curve
distance

Autodesk.DesignScript.Geometry.Curve.IsPlanar
Determine whether a Curve is planar or not
flat,liesinplane

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Get a CoordinateSystem with origin at the point at the given parameter. The XAxis is aligned with the curve normal,  the YAxis is aligned with the curve tangent at this point, and the ZAxis is aligned with the up-vector or binormal at this point
param:  The parameter at which to evaluate
Returns:  The aligned CoordinateSystem at the point
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Returns points spaced equally along the curve length  based on the input number of divisions
divisions:
Returns:  Points spaced equally along length of curve

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Returns points spaced along curve at equal chord length  based on the input number of divisions
divisions:
Returns:  List of points on curve

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Returns points spaced equally along the curve at given segment length and starting from the given point
point:  The reference point from where to measure
segmentLength:  The distance along the curve at which to evaluate
Returns:  List of points on curve

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Returns points spaced on the curve at given chord length starting from the given point
point:  The reference point from where to measure
chordLength:
Returns:  List of points on curve

Autodesk.DesignScript.Geometry.Curve.SegmentLengthAtParameter(System.Double)
Get the arc length along the Curve at the particular parameter.
param:  The parameter at which to evaluate
Returns:  The arc length
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Get the arc length along the Curve at the particular parameter.
param:  The parameter at which to evaluate
Returns:  The arc length
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.StartParameter
Get the start of the domain in which the curve can be evaluated
Returns:  The start of the domain in which the curve can be evaluated
start domain,curvestart

Autodesk.DesignScript.Geometry.Curve.EndParameter
Get the end of the domain in which the curve can be evaluated
Returns:  The end of the domain in which the curve can be evaluated
end domain,curveend

Autodesk.DesignScript.Geometry.Curve.SegmentLengthBetweenParameters(System.Double,System.Double)
Get the arc length between two parameter points on the curve
startParam:  The start of the domain
endParam:  The end of the domain
Returns:  The arc length between the two parameters
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Get the parameter at a particular point along the Curve. If the input Curve is a PolyCurve this function will return a valid parameter only if the Point lies on the PolyCurve. For other Curve types this function will return the parameter along the Curve which lies at the closest Point to the input Point.
point:  A Point along or near the Curve
Returns:  The parameter on the curve for PolyCurves or the closest parameter along the curve for other curve types.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Removes several segments of the Curve, disgarding 2nd, 4th, 6th ... segments if the bool is true
parameters:  A list of parameters at which to split the curve
discardEvenSegments:  Whether to discard even segments or not
Returns:  An Array of curves disgarding 2nd, 4th, 6th ... segments if the bool is true
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Join set of curves to the start of the end of the polycurve.  Flips curves to assure connectivity.
curves:
Returns:
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Extend a Curve by a given distance at a particular end determined by a pick Point.  The picked side will be extended.  Closed curves like Circles and Ellipses cannot be extended.
distance:  Distance to extend
pickSide:  A Point on the end to extend
Returns:  The extended Curve
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Extend a Curve by a given distance on its start side.  Closed curves like Circles and Ellipses cannot be extended.
distance:  Distance to extend
Returns:  The extended Curve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Extend a Curve by a given distance on its end.  Closed curves like Circles and Ellipses cannot be extended.
distance:  Distance to extend
Returns:  The extended Curve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
Patch a closed Curve
Returns:  A Surface on the interior of the curve the Curve
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Project another piece of Geometry onto this along a given direction Vector
baseGeometry:
projectionDirection:
Returns: