Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Form a Point in the XY plane given two 2 cartesian coordinates.  The Z component is 0.
x:
y:
Returns:
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Get the Origin point (0,0,0)
Returns:
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Form a Point given 3 cartesian coordinates
x:
y:
z:
Returns:
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system with 3 cartesian coordinates
cs:
x:
y:
z:
Returns:
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system given its position in cylindrical coordinates.
cs:  The coordinate system to build the point in
angle:  The angle is the rotation from the X axis in the coordinate system around the Z axis in degrees
elevation:  The elevation of the point above the XY plane
radius:  The distance from the origin of the coordinate system
Returns:  A new Point
point,localposition

Autodesk.DesignScript.Geometry.Point.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system given its position in spherical coordinates.
cs:  The coordinate system to build the point in
phi:  The angle down from the Z axis in degrees
theta:  The rotation around the sphere from the X axis in degrees
radius:  The offset from the origin
Returns:  A new Point
point,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Prune points to exclude duplicates within tolerance of included points
points:  Points to prune
tolerance:  Tolerance for pruning
Returns:
unique,duplicates,remove duplicates,distinct,near