Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing four indices
a:
b:
c:
d:
Returns:
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing three indices
a:
b:
c:
Returns:
tri,polygon,mesh,meshes