Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Creates a NurbsSurface with specified interpolated points and  U and V degrees.  The resultant surface will pass through all of the points.
points:
uDegree:
vDegree:
Returns:
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Create a NurbsSurface by using explicit control Points, with specified U and V degrees.
controlVertices:
uDegree:
vDegree:
Returns:

Autodesk.DesignScript.Geometry.NurbsSurface.DegreeU
Surface degree in the U direction.
surface smoothness,continuity

Autodesk.DesignScript.Geometry.NurbsSurface.DegreeV
Surface degree in the V direction.
surface smoothness,continuity

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Returns NurbsSurface control point weights.
Returns:
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Surface knots in U direction.
Returns:

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Surface knots in V direction.
Returns: