Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a Rectangle by four corner Points.
points:
Returns:
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a Rectangle by four corner Points.
p1:
p2:
p3:
p4:
Returns:
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Create a Rectangle centered at the WCS origin in the WCS XY Plane, with specified width (X Axis length), and length (Y Axis length).
width:
length:
Returns:
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Create a Rectangle centered at input Plane root, with input width  (Plane X axis length), and length (Plane Y axis length).
plane:
width:
length:
Returns:
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Create a Rectangle centered at the input origin in the CoordinateSystem  XY Plane, with specified width (X Axis length), and length  (Y Axis length).
cs:
width:
length:
Returns:
rectbylengths