Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Construct a Solid Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
cs:
radius:
height:
Returns:
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Construct a Solid Cylinder given the bottom and top center point of the Cylinder.
startPoint:
endPoint:
radius:
Returns:
cylinder,tube,by center points