Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Form a Vector by 3 Euclidean coordinates
x:  X coordinate
y:  Y coordinate
z:  Z coordinate
Returns:
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Form a Vector by 3 Euclidean coordinates and normalize the Vector
x:  X coordinate
y:  Y coordinate
z:  Z coordinate
normalized:  Whether to normalize the result Vector or not
Returns:
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Length
Get the length of the vector - otherwise known as the Euclidean norm
magnitude

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Form the dot product of two vectors
vec:
Returns:
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors are parallel or not
other:
Returns:

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors ae almost equal
other:
Returns:
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transform this Vector by input CoordinateSystem matrix.
cs:
Returns:

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates a Vector around an axis by a specified number of degrees
axis:
degrees:
Returns:
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates a vector around the Plane origin and normal by a specified  degree
plane:
degrees:
Returns:
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Scale Vector uniformly around the origin
scale_factor:
Returns:
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two Vectors, in the range [0, 180] degrees.
otherVector:
Returns:
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two Vectors, in the range [0, 360] degrees. It uses axis of rotation to determine the direction of the angle.
otherVector:
rotationAxis:
Returns:
rotation angle